{
    "data": {
        "id": "1906.05274v3",
        "published": "2020-03-02T02:24:54+00:00",
        "year": 2020,
        "month": 3,
        "title": "Efﬁcient Exploration via State Marginal Matching",
        "authors": [
            "Lisa Lee",
            "Benjamin Eysenbach",
            "Emilio Parisotto",
            "Eric Xing",
            "Sergey Levine",
            "Ruslan Salakhutdinov"
        ],
        "summary": "Exploration is critical to a reinforcement learning agent's performance in its given environment. Prior exploration methods are often based on using heuristic auxiliary predictions to guide policy behavior, lacking a mathematically-grounded objective with clear properties. In contrast, we recast exploration as a problem of State Marginal Matching (SMM), where we aim to learn a policy for which the state marginal distribution matches a given target state distribution. The target distribution is a uniform distribution in most cases, but can incorporate prior knowledge if available. In effect, SMM amortizes the cost of learning to explore in a given environment. The SMM objective can be viewed as a two-player, zero-sum game between a state density model and a parametric policy, an idea that we use to build an algorithm for optimizing the SMM objective. Using this formalism, we further demonstrate that prior work approximately maximizes the SMM objective, offering an explanation for the success of these methods. On both simulated and real-world tasks, we demonstrate that agents that directly optimize the SMM objective explore faster and adapt more quickly to new tasks as compared to prior exploration methods.",
        "journal_ref": null,
        "doi": null,
        "primary_category": "cs.LG",
        "categories": [
            "cs.LG",
            "cs.AI",
            "cs.RO",
            "stat.ML"
        ],
        "bib": "@article{1906.05274v3,\\nAuthor        = {Lisa Lee and Benjamin Eysenbach and Emilio Parisotto and Eric Xing and Sergey Levine and Ruslan Salakhutdinov},\\nTitle         = {Efficient Exploration via State Marginal Matching},\\nEprint        = {http://arxiv.org/abs/1906.05274v3},\\nArchivePrefix = {arXiv},\\nPrimaryClass  = {cs.LG},\\nAbstract      = {Exploration is critical to a reinforcement learning agent's performance in\\nits given environment. Prior exploration methods are often based on using\\nheuristic auxiliary predictions to guide policy behavior, lacking a\\nmathematically-grounded objective with clear properties. In contrast, we recast\\nexploration as a problem of State Marginal Matching (SMM), where we aim to\\nlearn a policy for which the state marginal distribution matches a given target\\nstate distribution. The target distribution is a uniform distribution in most\\ncases, but can incorporate prior knowledge if available. In effect, SMM\\namortizes the cost of learning to explore in a given environment. The SMM\\nobjective can be viewed as a two-player, zero-sum game between a state density\\nmodel and a parametric policy, an idea that we use to build an algorithm for\\noptimizing the SMM objective. Using this formalism, we further demonstrate that\\nprior work approximately maximizes the SMM objective, offering an explanation\\nfor the success of these methods. On both simulated and real-world tasks, we\\ndemonstrate that agents that directly optimize the SMM objective explore faster\\nand adapt more quickly to new tasks as compared to prior exploration methods.},\\nYear          = {2019},\\nMonth         = {6},\\nUrl           = {http://arxiv.org/pdf/1906.05274v3},\\nFile          = {1906.05274v3.pdf}\\n}",
        "reference": []
    }
}