{
    "data": {
        "id": "-1452618514829550696",
        "published": "2023-01-24T01:58:25+00:00",
        "year": 2023,
        "month": 1,
        "title": "A Context-Integrated Transformer-Based Neural Network forAuction Design",
        "authors": [],
        "summary": "",
        "journal_ref": "",
        "doi": "",
        "primary_category": "",
        "categories": [],
        "bib": "",
        "reference": [
            "",
            "Shai Shalev-Shwartz and Shai Ben-David. Understanding machine learning: From theory to algorithms . Cambridge university press, 2014.",
            "Negin Golrezaei, Adel Javanmard, and Vahab Mirrokni. Dynamic incentive-aware learning: Robust pricing in contextual auctions. Operations Research , 69(1):297–314, 2021.",
            "Neehar Peri, Michael J Curry, Samuel Dooley, and John P Dickerson. Preferencenet: Encoding human preferences in auction design with deep learning. arXiv preprint arXiv:2106.03215 , 2021.",
            "Yang Cai, Constantinos Daskalakis, and S Matthew Weinberg. An algorithmic characterization of multi-dimensional mechanisms. In Proceedings of the forty-fourth annual ACM symposium on Theory of computing , pages 459–478, 2012.",
            "Paul D¨ utting, Zhe Feng, Harikrishna Narasimhan, David Parkes, and Sai Srivatsa Ravindranath. Optimal auctions through deep learning. In International Conference on Machine Learning , pages 1706–1715. PMLR, 2019.",
            "Andrea Tacchetti, DJ Strouse, Marta Garnelo, Thore Graepel, and Yoram Bachrach. A neural archi- tecture for designing truthful and eﬃcient auctions. arXiv preprint arXiv:1907.05181 , 2019.",
            "Sergiu Hart and Noam Nisan. Approximate revenue maximization with multiple items. Journal of Economic Theory , 172:313–347, 2017.",
            "Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Lukasz Kaiser, and Illia Polosukhin. Attention is all you need. In Advances in neural information processing systems , pages 5998–6008, 2017.",
            "Vincent Conitzer and Tuomas Sandholm. Self-interested automated mechanism design and implica- tions for optimal combinatorial auctions. In Proceedings of the 5th ACM Conference on Electronic Commerce , pages 132–141, 2004.",
            "Xiangyu Liu, Chuan Yu, Zhilin Zhang, Zhenzhe Zheng, Yu Rong, Hongtao Lv, Da Huo, Yiqing Wang, Dagui Chen, Jian Xu, Fan Wu, Guihai Chen, and Xiaoqiang Zhu. Neural auction: End-to-end learning of auction mechanisms for e-commerce advertising. Proceedings of the 27th ACM SIGKDD Conference on Knowledge Discovery & Data Mining , 2021.",
            "Weiran Shen, Pingzhong Tang, and Song Zuo. Automated mechanism design via neural networks. In AAMAS , 2019.",
            "Maria-Florina F Balcan, Tuomas Sandholm, and Ellen Vitercik. Sample complexity of automated mechanism design. In Advances in Neural Information Processing Systems , pages 2083–2091, 2016.",
            "Alejandro M Manelli and Daniel R Vincent. Bundling as an optimal selling mechanism for a multiple- good monopolist. Journal of Economic Theory , 127(1):1–35, 2006.",
            "Moshe Babaioﬀ, Nicole Immorlica, Brendan Lucier, and S Matthew Weinberg. A simple and ap- proximately optimal mechanism for an additive buyer. In 2014 IEEE 55th Annual Symposium on Foundations of Computer Science , pages 21–30. IEEE, 2014.",
            "Nguyen Cong Luong, Zehui Xiong, Ping Wang, and Dusit Niyato. Optimal auction for edge computing resource management in mobile blockchain networks: A deep learning approach. In 2018 IEEE International Conference on Communications (ICC) , pages 1–6. IEEE, 2018.",
            "Maria-Florina Balcan, Avrim Blum, Jason D Hartline, and Yishay Mansour. Reducing mechanism design to algorithm design via machine learning. Journal of Computer and System Sciences , 74(8): 1245–1270, 2008.",
            "(F) 5 bidders and 10 items, which is, to the best of our knowledge, the largest auction size considered in previous literatures of deep learning based auction design [ Rahme et al. , 2021b ]. The discrete contexts and corresponding values are drawn similarly as Setting D .",
            "(H) 3 bidders and 10 items. The continuous contexts and corresponding values are drawn similarly as Setting C .",
            "Yang Cai and Mingfei Zhao. Simple mechanisms for subadditive buyers via duality. In Proceedings of the 49th Annual ACM SIGACT Symposium on Theory of Computing , pages 170–183, 2017.",
            "Paul D¨ utting, Felix Fischer, Pichayut Jirapinyo, John K Lai, Benjamin Lubin, and David C Parkes. Payment rules through discriminant-based classiﬁers, 2015.",
            "Andrew Chi-Chih Yao. An n-to-1 bidder reduction for multi-item auctions and its applications. In Proceedings of the Twenty-Sixth Annual ACM-SIAM Symposium on Discrete Algorithms , pages 92– 109. SIAM, 2014.",
            "Yiannis Giannakopoulos and Elias Koutsoupias. Duality and optimality of auctions for uniform dis- tributions. In Proceedings of the ﬁfteenth ACM conference on Economics and computation , pages 259–276, 2014.",
            "(G) 2 bidders and 5 items. The continuous contexts and corresponding values are drawn similarly as Setting C .",
            "Gregory Pavlov. Optimal mechanism for selling two goods. The BE Journal of Theoretical Economics , 11(1), 2011.",
            "Weiran Shen, Binghui Peng, Hanpeng Liu, Michael Zhang, Ruohan Qian, Yan Hong, Zhi Guo, Zongyao Ding, Pengjun Lu, and Pingzhong Tang. Reinforcement mechanism design: With applications to dynamic pricing in sponsored search auctions. In Proceedings of the AAAI Conference on Artiﬁcial Intelligence , volume 34, pages 2236–2243, 2020.",
            "Jianwei Huang, Zhu Han, Mung Chiang, and H Vincent Poor. Auction-based resource allocation for cooperative communications. IEEE Journal on Selected Areas in Communications , 26(7):1226–1237, 2008.",
            "Weiping Song, Chence Shi, Zhiping Xiao, Zhijian Duan, Yewen Xu, Ming Zhang, and Jian Tang. Autoint: Automatic feature interaction learning via self-attentive neural networks. In Proceedings of the 28th ACM International Conference on Information and Knowledge Management , pages 1161– 1170, 2019.",
            "Constantinos Daskalakis, Alan Deckelbaum, and Christos Tzamos. Strong duality for a multiple-good monopolist. Econometrica , 85(3):735–767, 2017.",
            "Nima Haghpanah and Jason Hartline. When is pure bundling optimal? The Review of Economic Studies , 88(3):1127–1156, 2021.",
            "Michael Curry, Ping-Yeh Chiang, Tom Goldstein, and John Dickerson. Certifying strategyproof auction networks. Advances in Neural Information Processing Systems , 33, 2020.",
            "S´ ebastien Lahaie. A kernel-based iterative combinatorial auction. In Twenty-Fifth AAAI Conference on Artiﬁcial Intelligence , 2011.",
            "Anton Zhiyanov and Alexey Drutsa. Bisection-based pricing for repeated contextual auctions against strategic buyer. In International Conference on Machine Learning , pages 11469–11480. PMLR, 2020.",
            "Jad Rahme, Samy Jelassi, and S. Matthew Weinberg. Auction learning as a two-player game. In 9th International Conference on Learning Representations , 2021b.",
            "Richard Cole and Tim Roughgarden. The sample complexity of revenue maximization. In Proceedings of the forty-sixth annual ACM symposium on Theory of computing , pages 243–252, 2014.",
            "Alexander H. Miller, Adam Fisch, Jesse Dodge, Amir-Hossein Karimi, Antoine Bordes, and Jason Weston. Key-value memory networks for directly reading documents. In EMNLP , 2016.",
            "Thomas Nedelec, Jules Baudet, Vianney Perchet, and Noureddine El Karoui. Adversarial learning for revenue-maximizing auctions. In AAMAS , 2021.",
            "Bernard J Jansen and Tracy Mullen. Sponsored search: an overview of the concept, history, and technology. International Journal of Electronic Business , 6(2):114–131, 2008.",
            "Hisham S Galal and Amr M Youssef. Veriﬁable sealed-bid auction on the ethereum blockchain. In International Conference on Financial Cryptography and Data Security , pages 265–278. Springer, 2018.",
            "Yannai A Gonczarowski and S Matthew Weinberg. The sample complexity of up-to- ε multi-dimensional revenue maximization. Journal of the ACM (JACM) , 68(3):1–28, 2021.",
            "Gianluca Brero, Alon Eden, Matthias Gerstgrasser, David Parkes, and Duncan Rheingans-Yoo. Re- inforcement learning of sequential price mechanisms. In Proceedings of the AAAI Conference on Artiﬁcial Intelligence , volume 35, pages 5219–5227, 2021.",
            "Kareem Amin, Afshin Rostamizadeh, and Umar Syed. Repeated contextual auctions with strategic buyers. Advances in Neural Information Processing Systems , 27:622–630, 2014.",
            "(I) 5 bidders and 10 items. The continuous contexts and corresponding values are drawn similarly as Setting C .",
            "Zhe Feng, Harikrishna Narasimhan, and David C Parkes. Deep learning for revenue-optimal auctions with budgets. In Proceedings of the 17th International Conference on Autonomous Agents and Multiagent Systems , pages 354–362, 2018.",
            "Zhijian Duan, Dinghuai Zhang, Wenhan Huang, Yali Du, Yaodong Yang, Jun Wang, and Xiaotie Deng. Pac learnability of approximate nash equilibrium in bimatrix games. arXiv preprint arXiv:2108.07472 , 2021.",
            "Andrew Chi-Chih Yao. Dominant-strategy versus bayesian multi-item auctions: Maximum revenue determination and comparison. In Proceedings of the 2017 ACM Conference on Economics and Computation , pages 3–20, 2017.",
            "Shuchi Chawla, Jason D Hartline, David L Malec, and Balasubramanian Sivan. Multi-parameter mechanism design and sequential posted pricing. In Proceedings of the forty-second ACM symposium on Theory of computing , pages 311–320, 2010.",
            "Roger B Myerson. Optimal auction design. Mathematics of operations research , 6(1):58–73, 1981. Thomas Nedelec, Jules Baudet, Vianney Perchet, and Noureddine El Karoui. Adversarial learning for revenue-maximizing auctions. In AAMAS , 2021.",
            "Diederik P Kingma and Jimmy Ba. Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980 , 2014.",
            "Alexey Drutsa. Optimal non-parametric learning in repeated contextual auctions with strategic buyer. In International Conference on Machine Learning , pages 2668–2677. PMLR, 2020.",
            "Jieming Mao, Renato Paes Leme, and Jon Schneider. Contextual pricing for lipschitz buyers. In NeurIPS , pages 5648–5656, 2018.",
            "Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg S Corrado, and JeﬀDean. Distributed representations of words and phrases and their compositionality. In Advances in neural information processing systems , pages 3111–3119, 2013.",
            "Jad Rahme, Samy Jelassi, Joan Bruna, and S. Matthew Weinberg. A permutation-equivariant neural network architecture for auction design. In AAAI , pages 5664–5672, 2021a.",
            "Vincent Conitzer and Tuomas Sandholm. Complexity of mechanism design. arXiv preprint cs/0205075 , 2002.",
            "Noah Golowich, Harikrishna Narasimhan, and David C Parkes. Deep learning for multi-facility location mechanism design. In IJCAI , pages 261–267, 2018.",
            "Tuomas Sandholm and Anton Likhodedov. Automated design of revenue-maximizing combinatorial auctions. Operations Research , 63(5):1000–1025, 2015.",
            "Chenghao Guo, Zhiyi Huang, and Xinzhi Zhang. Settling the sample complexity of single-parameter revenue maximization. In Proceedings of the 51st Annual ACM SIGACT Symposium on Theory of Computing , pages 662–673, 2019.",
            "Nikhil R Devanur, Zhiyi Huang, and Christos-Alexandros Psomas. The sample complexity of auctions with side information. In Proceedings of the forty-eighth annual ACM symposium on Theory of Computing , pages 426–439, 2016."
        ]
    }
}