{
    "data": [
        {
            "name": "Zero-Shot Forecasting Performance",
            "settings": "Datasets: Real-world datasets (M4, M5, Electricity, Traffic, Wiki-Forecast) and Synthetic datasets (Generated using various time series models such as ARIMA, LSTM). Evaluation Metrics: Mean Absolute Error (MAE), Root Mean Squared Error (RMSE), Symmetric Mean Absolute Percentage Error (sMAPE). Baselines: State-of-the-art supervised forecasting models (ARIMA, LSTM, Prophet, DeepAR, and Temporal Fusion Transformer (TFT)).",
            "results": "The proposed model achieved competitive zero-shot forecasting performance across all datasets. On the M4 dataset, the model's sMAPE was within 5% of the best-performing supervised model. For the Electricity dataset, the model's RMSE was comparable to the LSTM baseline. On synthetic datasets, the model consistently outperformed ARIMA and LSTM baselines."
        },
        {
            "name": "Robustness to Different Forecasting Horizons",
            "settings": "Datasets: M4, M5, Traffic. Forecasting Horizons: Short-term (1 hour), Medium-term (1 day), Long-term (1 week). Evaluation Metrics: MAE, RMSE, sMAPE. Baselines: ARIMA, LSTM, Prophet, DeepAR, TFT.",
            "results": "The model demonstrated consistent performance across different forecasting horizons. For short-term forecasting, the model's MAE was lower than all baselines on the Traffic dataset. In medium-term forecasting, the model's RMSE on the M5 dataset was within 3% of the best baseline. For long-term forecasting, the model's sMAPE on the M4 dataset was comparable to the TFT baseline."
        },
        {
            "name": "Temporal Granularity Adaptation",
            "settings": "Datasets: Electricity, Traffic, Wiki-Forecast. Temporal Granularities: Hourly, Daily, Weekly. Evaluation Metrics: MAE, RMSE, sMAPE. Baselines: ARIMA, LSTM, Prophet, DeepAR, TFT.",
            "results": "The model showed strong performance across different temporal granularities. For hourly data, the model's RMSE on the Electricity dataset was lower than the LSTM baseline. For daily data, the model's MAE on the Traffic dataset was comparable to the TFT baseline. For weekly data, the model's sMAPE on the Wiki-Forecast dataset was within 4% of the best baseline."
        }
    ]
}